hw4/app/controllers/movies_controller.rb

  def same_director
    @id = params[:id]
    @movie = Movie.find_by(id: @id)

    director_name = @movie.director
    if not director_name or director_name.empty?
      flash[:notice] = "'#{@movie.title}' has no director info"
      redirect_to movies_path
    else
      @movies = Movie.where(director: director_name)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "movies".* FROM "movies" WHERE "movies"."director" = ? LIMIT 1  [["director", "George Lucas"]]